ir_version: 10
producer_name: "pytorch"
producer_version: "2.10.0+cu128"
model_version: 0
graph {
  name: "main_graph"
  node {
    input: "images"
    input: "val_5"
    output: "view"
    name: "node_view"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 1
      type: INT
    }

  }
  node {
    input: "view"
    input: "img_backbone.conv1.weight"
    input: "img_backbone.conv1.weight_bias"
    output: "getitem"
    name: "node_Conv_4873"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 3
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem"
    output: "relu"
    name: "node_relu"
    op_type: "Relu"

  }
  node {
    input: "relu"
    output: "max_pool2d"
    name: "node_max_pool2d"
    op_type: "MaxPool"
    attribute {
      name: "storage_order"
      i: 0
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }

  }
  node {
    input: "max_pool2d"
    input: "img_backbone.layer1.0.conv1.weight"
    input: "img_backbone.layer1.0.conv1.weight_bias"
    output: "getitem_3"
    name: "node_Conv_4875"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_3"
    output: "relu_1"
    name: "node_relu_1"
    op_type: "Relu"

  }
  node {
    input: "relu_1"
    input: "img_backbone.layer1.0.conv2.weight"
    input: "img_backbone.layer1.0.conv2.weight_bias"
    output: "getitem_6"
    name: "node_Conv_4877"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_6"
    output: "relu_2"
    name: "node_relu_2"
    op_type: "Relu"

  }
  node {
    input: "relu_2"
    input: "img_backbone.layer1.0.conv3.weight"
    input: "img_backbone.layer1.0.conv3.weight_bias"
    output: "getitem_9"
    name: "node_Conv_4879"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "max_pool2d"
    input: "img_backbone.layer1.0.downsample.0.weight"
    input: "img_backbone.layer1.0.downsample.0.weight_bias"
    output: "getitem_12"
    name: "node_Conv_4881"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_9"
    input: "getitem_12"
    output: "add"
    name: "node_add"
    op_type: "Add"

  }
  node {
    input: "add"
    output: "relu_3"
    name: "node_relu_3"
    op_type: "Relu"

  }
  node {
    input: "relu_3"
    input: "img_backbone.layer1.1.conv1.weight"
    input: "img_backbone.layer1.1.conv1.weight_bias"
    output: "getitem_15"
    name: "node_Conv_4883"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_15"
    output: "relu_4"
    name: "node_relu_4"
    op_type: "Relu"

  }
  node {
    input: "relu_4"
    input: "img_backbone.layer1.1.conv2.weight"
    input: "img_backbone.layer1.1.conv2.weight_bias"
    output: "getitem_18"
    name: "node_Conv_4885"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_18"
    output: "relu_5"
    name: "node_relu_5"
    op_type: "Relu"

  }
  node {
    input: "relu_5"
    input: "img_backbone.layer1.1.conv3.weight"
    input: "img_backbone.layer1.1.conv3.weight_bias"
    output: "getitem_21"
    name: "node_Conv_4887"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_21"
    input: "relu_3"
    output: "add_1"
    name: "node_add_1"
    op_type: "Add"

  }
  node {
    input: "add_1"
    output: "relu_6"
    name: "node_relu_6"
    op_type: "Relu"

  }
  node {
    input: "relu_6"
    input: "img_backbone.layer1.2.conv1.weight"
    input: "img_backbone.layer1.2.conv1.weight_bias"
    output: "getitem_24"
    name: "node_Conv_4889"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_24"
    output: "relu_7"
    name: "node_relu_7"
    op_type: "Relu"

  }
  node {
    input: "relu_7"
    input: "img_backbone.layer1.2.conv2.weight"
    input: "img_backbone.layer1.2.conv2.weight_bias"
    output: "getitem_27"
    name: "node_Conv_4891"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_27"
    output: "relu_8"
    name: "node_relu_8"
    op_type: "Relu"

  }
  node {
    input: "relu_8"
    input: "img_backbone.layer1.2.conv3.weight"
    input: "img_backbone.layer1.2.conv3.weight_bias"
    output: "getitem_30"
    name: "node_Conv_4893"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_30"
    input: "relu_6"
    output: "add_2"
    name: "node_add_2"
    op_type: "Add"

  }
  node {
    input: "add_2"
    output: "relu_9"
    name: "node_relu_9"
    op_type: "Relu"

  }
  node {
    input: "relu_9"
    input: "img_backbone.layer2.0.conv1.weight"
    input: "img_backbone.layer2.0.conv1.weight_bias"
    output: "getitem_33"
    name: "node_Conv_4895"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_33"
    output: "relu_10"
    name: "node_relu_10"
    op_type: "Relu"

  }
  node {
    input: "relu_10"
    input: "img_backbone.layer2.0.conv2.weight"
    input: "img_backbone.layer2.0.conv2.weight_bias"
    output: "getitem_36"
    name: "node_Conv_4897"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_36"
    output: "relu_11"
    name: "node_relu_11"
    op_type: "Relu"

  }
  node {
    input: "relu_11"
    input: "img_backbone.layer2.0.conv3.weight"
    input: "img_backbone.layer2.0.conv3.weight_bias"
    output: "getitem_39"
    name: "node_Conv_4899"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "relu_9"
    input: "img_backbone.layer2.0.downsample.0.weight"
    input: "img_backbone.layer2.0.downsample.0.weight_bias"
    output: "getitem_42"
    name: "node_Conv_4901"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_39"
    input: "getitem_42"
    output: "add_3"
    name: "node_add_3"
    op_type: "Add"

  }
  node {
    input: "add_3"
    output: "relu_12"
    name: "node_relu_12"
    op_type: "Relu"

  }
  node {
    input: "relu_12"
    input: "img_backbone.layer2.1.conv1.weight"
    input: "img_backbone.layer2.1.conv1.weight_bias"
    output: "getitem_45"
    name: "node_Conv_4903"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_45"
    output: "relu_13"
    name: "node_relu_13"
    op_type: "Relu"

  }
  node {
    input: "relu_13"
    input: "img_backbone.layer2.1.conv2.weight"
    input: "img_backbone.layer2.1.conv2.weight_bias"
    output: "getitem_48"
    name: "node_Conv_4905"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_48"
    output: "relu_14"
    name: "node_relu_14"
    op_type: "Relu"

  }
  node {
    input: "relu_14"
    input: "img_backbone.layer2.1.conv3.weight"
    input: "img_backbone.layer2.1.conv3.weight_bias"
    output: "getitem_51"
    name: "node_Conv_4907"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_51"
    input: "relu_12"
    output: "add_4"
    name: "node_add_4"
    op_type: "Add"

  }
  node {
    input: "add_4"
    output: "relu_15"
    name: "node_relu_15"
    op_type: "Relu"

  }
  node {
    input: "relu_15"
    input: "img_backbone.layer2.2.conv1.weight"
    input: "img_backbone.layer2.2.conv1.weight_bias"
    output: "getitem_54"
    name: "node_Conv_4909"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_54"
    output: "relu_16"
    name: "node_relu_16"
    op_type: "Relu"

  }
  node {
    input: "relu_16"
    input: "img_backbone.layer2.2.conv2.weight"
    input: "img_backbone.layer2.2.conv2.weight_bias"
    output: "getitem_57"
    name: "node_Conv_4911"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_57"
    output: "relu_17"
    name: "node_relu_17"
    op_type: "Relu"

  }
  node {
    input: "relu_17"
    input: "img_backbone.layer2.2.conv3.weight"
    input: "img_backbone.layer2.2.conv3.weight_bias"
    output: "getitem_60"
    name: "node_Conv_4913"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_60"
    input: "relu_15"
    output: "add_5"
    name: "node_add_5"
    op_type: "Add"

  }
  node {
    input: "add_5"
    output: "relu_18"
    name: "node_relu_18"
    op_type: "Relu"

  }
  node {
    input: "relu_18"
    input: "img_backbone.layer2.3.conv1.weight"
    input: "img_backbone.layer2.3.conv1.weight_bias"
    output: "getitem_63"
    name: "node_Conv_4915"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_63"
    output: "relu_19"
    name: "node_relu_19"
    op_type: "Relu"

  }
  node {
    input: "relu_19"
    input: "img_backbone.layer2.3.conv2.weight"
    input: "img_backbone.layer2.3.conv2.weight_bias"
    output: "getitem_66"
    name: "node_Conv_4917"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_66"
    output: "relu_20"
    name: "node_relu_20"
    op_type: "Relu"

  }
  node {
    input: "relu_20"
    input: "img_backbone.layer2.3.conv3.weight"
    input: "img_backbone.layer2.3.conv3.weight_bias"
    output: "getitem_69"
    name: "node_Conv_4919"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_69"
    input: "relu_18"
    output: "add_6"
    name: "node_add_6"
    op_type: "Add"

  }
  node {
    input: "add_6"
    output: "relu_21"
    name: "node_relu_21"
    op_type: "Relu"

  }
  node {
    input: "relu_21"
    input: "img_backbone.layer3.0.conv1.weight"
    input: "img_backbone.layer3.0.conv1.weight_bias"
    output: "getitem_72"
    name: "node_Conv_4921"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_72"
    output: "relu_22"
    name: "node_relu_22"
    op_type: "Relu"

  }
  node {
    input: "relu_22"
    input: "img_backbone.layer3.0.conv2.weight"
    input: "img_backbone.layer3.0.conv2.weight_bias"
    output: "getitem_75"
    name: "node_Conv_4923"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_75"
    output: "relu_23"
    name: "node_relu_23"
    op_type: "Relu"

  }
  node {
    input: "relu_23"
    input: "img_backbone.layer3.0.conv3.weight"
    input: "img_backbone.layer3.0.conv3.weight_bias"
    output: "getitem_78"
    name: "node_Conv_4925"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "relu_21"
    input: "img_backbone.layer3.0.downsample.0.weight"
    input: "img_backbone.layer3.0.downsample.0.weight_bias"
    output: "getitem_81"
    name: "node_Conv_4927"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_78"
    input: "getitem_81"
    output: "add_7"
    name: "node_add_7"
    op_type: "Add"

  }
  node {
    input: "add_7"
    output: "relu_24"
    name: "node_relu_24"
    op_type: "Relu"

  }
  node {
    input: "relu_24"
    input: "img_backbone.layer3.1.conv1.weight"
    input: "img_backbone.layer3.1.conv1.weight_bias"
    output: "getitem_84"
    name: "node_Conv_4929"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_84"
    output: "relu_25"
    name: "node_relu_25"
    op_type: "Relu"

  }
  node {
    input: "relu_25"
    input: "img_backbone.layer3.1.conv2.weight"
    input: "img_backbone.layer3.1.conv2.weight_bias"
    output: "getitem_87"
    name: "node_Conv_4931"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_87"
    output: "relu_26"
    name: "node_relu_26"
    op_type: "Relu"

  }
  node {
    input: "relu_26"
    input: "img_backbone.layer3.1.conv3.weight"
    input: "img_backbone.layer3.1.conv3.weight_bias"
    output: "getitem_90"
    name: "node_Conv_4933"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_90"
    input: "relu_24"
    output: "add_8"
    name: "node_add_8"
    op_type: "Add"

  }
  node {
    input: "add_8"
    output: "relu_27"
    name: "node_relu_27"
    op_type: "Relu"

  }
  node {
    input: "relu_27"
    input: "img_backbone.layer3.2.conv1.weight"
    input: "img_backbone.layer3.2.conv1.weight_bias"
    output: "getitem_93"
    name: "node_Conv_4935"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_93"
    output: "relu_28"
    name: "node_relu_28"
    op_type: "Relu"

  }
  node {
    input: "relu_28"
    input: "img_backbone.layer3.2.conv2.weight"
    input: "img_backbone.layer3.2.conv2.weight_bias"
    output: "getitem_96"
    name: "node_Conv_4937"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_96"
    output: "relu_29"
    name: "node_relu_29"
    op_type: "Relu"

  }
  node {
    input: "relu_29"
    input: "img_backbone.layer3.2.conv3.weight"
    input: "img_backbone.layer3.2.conv3.weight_bias"
    output: "getitem_99"
    name: "node_Conv_4939"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_99"
    input: "relu_27"
    output: "add_9"
    name: "node_add_9"
    op_type: "Add"

  }
  node {
    input: "add_9"
    output: "relu_30"
    name: "node_relu_30"
    op_type: "Relu"

  }
  node {
    input: "relu_30"
    input: "img_backbone.layer3.3.conv1.weight"
    input: "img_backbone.layer3.3.conv1.weight_bias"
    output: "getitem_102"
    name: "node_Conv_4941"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_102"
    output: "relu_31"
    name: "node_relu_31"
    op_type: "Relu"

  }
  node {
    input: "relu_31"
    input: "img_backbone.layer3.3.conv2.weight"
    input: "img_backbone.layer3.3.conv2.weight_bias"
    output: "getitem_105"
    name: "node_Conv_4943"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_105"
    output: "relu_32"
    name: "node_relu_32"
    op_type: "Relu"

  }
  node {
    input: "relu_32"
    input: "img_backbone.layer3.3.conv3.weight"
    input: "img_backbone.layer3.3.conv3.weight_bias"
    output: "getitem_108"
    name: "node_Conv_4945"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_108"
    input: "relu_30"
    output: "add_10"
    name: "node_add_10"
    op_type: "Add"

  }
  node {
    input: "add_10"
    output: "relu_33"
    name: "node_relu_33"
    op_type: "Relu"

  }
  node {
    input: "relu_33"
    input: "img_backbone.layer3.4.conv1.weight"
    input: "img_backbone.layer3.4.conv1.weight_bias"
    output: "getitem_111"
    name: "node_Conv_4947"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_111"
    output: "relu_34"
    name: "node_relu_34"
    op_type: "Relu"

  }
  node {
    input: "relu_34"
    input: "img_backbone.layer3.4.conv2.weight"
    input: "img_backbone.layer3.4.conv2.weight_bias"
    output: "getitem_114"
    name: "node_Conv_4949"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_114"
    output: "relu_35"
    name: "node_relu_35"
    op_type: "Relu"

  }
  node {
    input: "relu_35"
    input: "img_backbone.layer3.4.conv3.weight"
    input: "img_backbone.layer3.4.conv3.weight_bias"
    output: "getitem_117"
    name: "node_Conv_4951"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_117"
    input: "relu_33"
    output: "add_11"
    name: "node_add_11"
    op_type: "Add"

  }
  node {
    input: "add_11"
    output: "relu_36"
    name: "node_relu_36"
    op_type: "Relu"

  }
  node {
    input: "relu_36"
    input: "img_backbone.layer3.5.conv1.weight"
    input: "img_backbone.layer3.5.conv1.weight_bias"
    output: "getitem_120"
    name: "node_Conv_4953"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_120"
    output: "relu_37"
    name: "node_relu_37"
    op_type: "Relu"

  }
  node {
    input: "relu_37"
    input: "img_backbone.layer3.5.conv2.weight"
    input: "img_backbone.layer3.5.conv2.weight_bias"
    output: "getitem_123"
    name: "node_Conv_4955"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_123"
    output: "relu_38"
    name: "node_relu_38"
    op_type: "Relu"

  }
  node {
    input: "relu_38"
    input: "img_backbone.layer3.5.conv3.weight"
    input: "img_backbone.layer3.5.conv3.weight_bias"
    output: "getitem_126"
    name: "node_Conv_4957"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_126"
    input: "relu_36"
    output: "add_12"
    name: "node_add_12"
    op_type: "Add"

  }
  node {
    input: "add_12"
    output: "relu_39"
    name: "node_relu_39"
    op_type: "Relu"

  }
  node {
    input: "relu_39"
    input: "img_backbone.layer4.0.conv1.weight"
    input: "img_backbone.layer4.0.conv1.weight_bias"
    output: "getitem_129"
    name: "node_Conv_4959"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_129"
    output: "relu_40"
    name: "node_relu_40"
    op_type: "Relu"

  }
  node {
    input: "relu_40"
    input: "img_backbone.layer4.0.conv2.weight"
    input: "img_backbone.layer4.0.conv2.weight_bias"
    output: "getitem_132"
    name: "node_Conv_4961"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_132"
    output: "relu_41"
    name: "node_relu_41"
    op_type: "Relu"

  }
  node {
    input: "relu_41"
    input: "img_backbone.layer4.0.conv3.weight"
    input: "img_backbone.layer4.0.conv3.weight_bias"
    output: "getitem_135"
    name: "node_Conv_4963"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "relu_39"
    input: "img_backbone.layer4.0.downsample.0.weight"
    input: "img_backbone.layer4.0.downsample.0.weight_bias"
    output: "getitem_138"
    name: "node_Conv_4965"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_135"
    input: "getitem_138"
    output: "add_13"
    name: "node_add_13"
    op_type: "Add"

  }
  node {
    input: "add_13"
    output: "relu_42"
    name: "node_relu_42"
    op_type: "Relu"

  }
  node {
    input: "relu_42"
    input: "img_backbone.layer4.1.conv1.weight"
    input: "img_backbone.layer4.1.conv1.weight_bias"
    output: "getitem_141"
    name: "node_Conv_4967"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_141"
    output: "relu_43"
    name: "node_relu_43"
    op_type: "Relu"

  }
  node {
    input: "relu_43"
    input: "img_backbone.layer4.1.conv2.weight"
    input: "img_backbone.layer4.1.conv2.weight_bias"
    output: "getitem_144"
    name: "node_Conv_4969"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_144"
    output: "relu_44"
    name: "node_relu_44"
    op_type: "Relu"

  }
  node {
    input: "relu_44"
    input: "img_backbone.layer4.1.conv3.weight"
    input: "img_backbone.layer4.1.conv3.weight_bias"
    output: "getitem_147"
    name: "node_Conv_4971"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_147"
    input: "relu_42"
    output: "add_14"
    name: "node_add_14"
    op_type: "Add"

  }
  node {
    input: "add_14"
    output: "relu_45"
    name: "node_relu_45"
    op_type: "Relu"

  }
  node {
    input: "relu_45"
    input: "img_backbone.layer4.2.conv1.weight"
    input: "img_backbone.layer4.2.conv1.weight_bias"
    output: "getitem_150"
    name: "node_Conv_4973"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_150"
    output: "relu_46"
    name: "node_relu_46"
    op_type: "Relu"

  }
  node {
    input: "relu_46"
    input: "img_backbone.layer4.2.conv2.weight"
    input: "img_backbone.layer4.2.conv2.weight_bias"
    output: "getitem_153"
    name: "node_Conv_4975"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_153"
    output: "relu_47"
    name: "node_relu_47"
    op_type: "Relu"

  }
  node {
    input: "relu_47"
    input: "img_backbone.layer4.2.conv3.weight"
    input: "img_backbone.layer4.2.conv3.weight_bias"
    output: "getitem_156"
    name: "node_Conv_4977"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "getitem_156"
    input: "relu_45"
    output: "add_15"
    name: "node_add_15"
    op_type: "Add"

  }
  node {
    input: "add_15"
    output: "relu_48"
    name: "node_relu_48"
    op_type: "Relu"

  }
  node {
    input: "relu_48"
    input: "img_neck.lateral_convs.0.conv.weight"
    input: "img_neck.lateral_convs.0.conv.bias"
    output: "conv2d_53"
    name: "node_conv2d_53"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "conv2d_53"
    input: "img_neck.fpn_convs.0.conv.weight"
    input: "img_neck.fpn_convs.0.conv.bias"
    output: "conv2d_54"
    name: "node_conv2d_54"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }

  }
  node {
    input: "pts_bbox_head.bev_embedding.weight"
    input: "val_850"
    output: "unsqueeze"
    name: "node_unsqueeze"
    op_type: "Unsqueeze"

  }
  node {
    input: "unsqueeze"
    input: "val_598"
    output: "expand"
    name: "node_expand"
    op_type: "Expand"

  }
  node {
    input: "unsqueeze_1"
    input: "val_608"
    output: "expand_1"
    name: "node_expand_1"
    op_type: "Expand"

  }
  node {
    input: "unsqueeze_2"
    input: "val_614"
    output: "expand_2"
    name: "node_expand_2"
    op_type: "Expand"

  }
  node {
    input: "expand_1"
    input: "expand_2"
    output: "cat"
    name: "node_cat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: -1
      type: INT
    }

  }
  node {
    input: "cat"
    input: "val_619"
    output: "view_1"
    name: "node_view_1"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 1
      type: INT
    }

  }
  node {
    input: "view_1"
    input: "val_598"
    output: "expand_3"
    name: "node_expand_3"
    op_type: "Expand"

  }
  node {
    input: "conv2d_54"
    input: "val_629"
    output: "view_2"
    name: "node_view_2"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 1
      type: INT
    }

  }
  node {
    input: "view_2"
    output: "permute"
    name: "node_permute"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      type: INTS
    }

  }
  node {
    input: "permute"
    input: "unsqueeze_4"
    output: "add_16"
    name: "node_add_16"
    op_type: "Add"

  }
  node {
    input: "add_16"
    input: "val_636"
    output: "view_3"
    name: "node_view_3"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 1
      type: INT
    }

  }
  node {
    input: "view_3"
    input: "unsqueeze_6"
    output: "add_17"
    name: "node_add_17"
    op_type: "Add"

  }
  node {
    input: "add_17"
    input: "val_642"
    output: "view_4"
    name: "node_view_4"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 1
      type: INT
    }

  }
  node {
    input: "relu_49"
    input: "pts_bbox_head.transformer.can_bus_mlp.2.weight"
    input: "pts_bbox_head.transformer.can_bus_mlp.2.bias"
    output: "linear_1"
    name: "node_linear_1"
    op_type: "Gemm"
    attribute {
      name: "beta"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "transB"
      i: 1
      type: INT
    }
    attribute {
      name: "alpha"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "transA"
      i: 0
      type: INT
    }

  }
  node {
    input: "linear_1"
    input: "pts_bbox_head.transformer.can_bus_mlp.norm.weight"
    input: "pts_bbox_head.transformer.can_bus_mlp.norm.bias"
    output: "layer_norm"
    name: "node_layer_norm"
    op_type: "LayerNormalization"
    attribute {
      name: "stash_type"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "axis"
      i: -1
      type: INT
    }

  }
  node {
    input: "layer_norm"
    input: "val_853"
    output: "unsqueeze_7"
    name: "node_unsqueeze_7"
    op_type: "Unsqueeze"

  }
  node {
    input: "expand"
    input: "unsqueeze_7"
    output: "add_18"
    name: "node_add_18"
    op_type: "Add"

  }
  node {
    input: "expand_7"
    input: "val_757"
    output: "div_2"
    name: "node_div_2"
    op_type: "Div"

  }
  node {
    input: "expand_8"
    input: "scalar_tensor_default_2"
    output: "div_3"
    name: "node_div_3"
    op_type: "Div"

  }
  node {
    input: "expand_9"
    input: "scalar_tensor_default_2"
    output: "div_4"
    name: "node_div_4"
    op_type: "Div"

  }
  node {
    input: "div_3"
    input: "val_818"
    output: "val_819"
    name: "node_Unsqueeze_816"
    op_type: "Unsqueeze"

  }
  node {
    input: "div_4"
    input: "val_818"
    output: "val_821"
    name: "node_Unsqueeze_818"
    op_type: "Unsqueeze"

  }
  node {
    input: "div_2"
    input: "val_818"
    output: "val_823"
    name: "node_Unsqueeze_820"
    op_type: "Unsqueeze"

  }
  node {
    input: "val_819"
    input: "val_821"
    input: "val_823"
    output: "stack_1"
    name: "node_stack_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: -1
      type: INT
    }

  }
  node {
    input: "stack_1"
    output: "permute_1"
    name: "node_permute_1"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 3
      ints: 1
      ints: 2
      type: INTS
    }

  }
  node {
    input: "permute_1"
    input: "val_828"
    output: "view_10"
    name: "node_view_10"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 1
      type: INT
    }

  }
  node {
    input: "view_10"
    output: "permute_2"
    name: "node_permute_2"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      type: INTS
    }

  }
  node {
    input: "permute_2"
    input: "val_853"
    output: "unsqueeze_10"
    name: "node_unsqueeze_10"
    op_type: "Unsqueeze"

  }
  node {
    input: "unsqueeze_10"
    input: "val_834"
    output: "expand_10"
    name: "node_expand_10"
    op_type: "Expand"

  }
  node {
    input: "expand_10"
    input: "val_850"
    input: "val_853"
    input: "val_857"
    input: "val_853"
    output: "slice_1"
    name: "node_slice_1"
    op_type: "Slice"

  }
  node {
    input: "slice_1"
    input: "val_859"
    output: "mul_2"
    name: "node_mul_2"
    op_type: "Mul"

  }
  node {
    input: "mul_2"
    input: "val_860"
    output: "copy_2"
    name: "node_copy_2"
    op_type: "Add"

  }
  node {
    input: "copy_2"
    output: "val_881"
    name: "node_Transpose_878"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 3
      ints: 1
      ints: 2
      ints: 0
      type: INTS
    }

  }
  node {
    input: "expand_10"
    output: "val_882"
    name: "node_Transpose_879"
    op_type: "Transpose"
